<div id="container" style="position:relative;">
<div style="float:left"><h1> Capstone: Data Science Salary 2024 | Minh Hai Tran_Part 1</h1></div>
<div style="position:relative; float:right"><img style="height:65px" src="" />
</div>
</div>

-----------------------------------
## Date March 2024
## DATA CHOOSING AND CLEANING

# Introduction

In the dynamic field of data science, understanding salary trends is crucial for professionals and organizations. This dataset provides insights into Data Science Salaries from 2020 to 2024, offering valuable information on trends, regional variations, and factors influencing compensation for data enthusiasts, researchers, and industry professionals.

# Impact
This project is anticipated to bring tangible benefits to both society and businesses. By leveraging advanced technology, the aim is to assist companies in setting salaries more effectively, thereby increasing employee satisfaction and reducing turnover rates. This could potentially save businesses expenses associated with hiring and training new staff. Additionally, by streamlining the salary negotiation process, both employees and companies can save valuable time. Moreover, offering fair and competitive pay can help companies attract top talent, giving them a competitive edge in the market. In essence, the project aims to enhance the salary determination process for all stakeholders involvd

# About data
The primary dataset was multiple datasets sourced from ai-jobs.net and kaggle, consisting 9 datasets and will be cleaned in this part, 11 columns as data Dictionary below.

#### Data Dictionary


| Column Name       | Description                                                                                                        |
|-------------------|--------------------------------------------------------------------------------------------------------------------|
| work_year         | The year when the salary was paid.                                                                                 |
| experience_level  | The job experience level categorized as follows: EN (Entry-level / Junior), MI (Mid-level / Intermediate), SE (Senior-level / Expert), EX (Executive-level / Director). |
| employment_type   | Type of employment for the role: PT (Part-time), FT (Full-time), CT (Contract), FL (Freelance).                  |
| job_title         | The role held during the year.                                                                                     |
| salary            | Total gross salary amount paid.                                                                                    |
| salary_currency   | Currency of the salary paid as an ISO 4217 currency code.                                                          |
| salary_in_usd     | Salary converted to USD using statistical data from the BIS and central banks.                                      |
| employee_residence| Employee's primary country of residence during the work year as an ISO 3166 country code.                          |
| remote_ratio      | The percentage of work done remotely, categorized as: 0 (No remote work), 50 (Partially remote/hybrid), 100 (Fully remote).|
| company_location  | Country of the employer's main office or contracting branch as an ISO 3166 country code.                          |
| company_size      | The average number of employees in the company, categorized as: S (Less than 50 employees), M (50 to 250 employees), L (More than 250 employees). |

___

### Table of content:
#### Part 1: Explore datasets
- 1.1: salaries_1
- 1.2: salaries_2
- 1.3: salaries_3
- 1.4: salaries_4
- 1.5: salaries_5
- 1.6: salaries_6
- 1.7: salaries_7
- 1.8: salaries_8
- 1.9: salaries_9
#### Part 2: Create a cleaning dataframe
- 2.1: Merging useful datasets- 2.2: Build a cleaning dataframe
- 2.3: Choose target columns
---

In [1]:
# Basic packages
import numpy as np
import pandas as pd
import os

### Par 1: Explore datasets

#### 1.1. data salaries_1.csv

In [2]:
# Loading dataset
df1 = pd.read_csv('dataset_new/salaries_1.csv')

# Take a look at the data
display(df1)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,EN,FL,Applied Data Scientist,30000,USD,30000,GB,100,GB,M
1,2024,EX,FT,Business Intelligence,230000,USD,230000,US,0,US,M
2,2024,EX,FT,Business Intelligence,176900,USD,176900,US,0,US,M
3,2024,SE,FT,Data Architect,171210,USD,171210,CA,0,CA,M
4,2024,SE,FT,Data Architect,92190,USD,92190,CA,0,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
14293,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
14294,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
14295,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
14296,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
14297,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14298 entries, 0 to 14297
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           14298 non-null  int64
 1   experience_level    14298 non-null  object
 2   employment_type     14298 non-null  object
 3   job_title           14298 non-null  object
 4   salary              14298 non-null  int64
 5   salary_currency     14298 non-null  object
 6   salary_in_usd       14298 non-null  int64
 7   employee_residence  14298 non-null  object
 8   remote_ratio        14298 non-null  int64
 9   company_location    14298 non-null  object
 10  company_size        14298 non-null  object
dtypes: int64(4), object(7)
memory usage: 1.2+ MB

In [4]:
df1.shape

(14298, 11)

In [5]:
#check null data
df1.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [6]:
# check duplicated rows and columns
# Check for duplicated column
df1.T.duplicated().sum()

0

First dataset shows data with 11 columns without duplicated data and 14,298 rows. There is no null data. We will explore other dataset before deciding to check the duplicated rows.

#### 1.2. data salaries_2.csv

In [7]:
# Loading dataset
df2 = pd.read_csv('dataset_new/salaries_2.csv')

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15154 entries, 0 to 15153
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           15154 non-null  int64
 1   experience_level    15154 non-null  object
 2   employment_type     15154 non-null  object
 3   job_title           15154 non-null  object
 4   salary              15154 non-null  int64
 5   salary_currency     15154 non-null  object
 6   salary_in_usd       15154 non-null  int64
 7   employee_residence  15154 non-null  object
 8   remote_ratio        15154 non-null  int64
 9   company_location    15154 non-null  object
 10  company_size        15154 non-null  object
dtypes: int64(4), object(7)
memory usage: 1.3+ MB

In [9]:
df2.shape

(15154, 11)

In [10]:
#check null data
df2.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [11]:
# check duplicated rows and columns
# Check for duplicated column
df2.T.duplicated().sum()

0

Similarly to dataset 1, dataset 2 also has 11 columns without duplicated and the dataset has 15,154 rows.

#### 1.3. data salaries_3.csv

In [12]:
# Loading dataset
df3 = pd.read_csv('dataset_new/salaries_3.csv')

In [13]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14838 entries, 0 to 14837
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           14838 non-null  int64
 1   experience_level    14838 non-null  object
 2   employment_type     14838 non-null  object
 3   job_title           14838 non-null  object
 4   salary              14838 non-null  int64
 5   salary_currency     14838 non-null  object
 6   salary_in_usd       14838 non-null  int64
 7   employee_residence  14838 non-null  object
 8   remote_ratio        14838 non-null  int64
 9   company_location    14838 non-null  object
 10  company_size        14838 non-null  object
dtypes: int64(4), object(7)
memory usage: 1.2+ MB

In [14]:
df3.shape

(14838, 11)

In [15]:
#check null data
df3.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [16]:
# check duplicated rows and columns
# Check for duplicated column
df3.T.duplicated().sum()

0

dataset 3 has 14,834 rows of data with 11 columns names similar to dataset 1&2.

#### 1.4. data salaries_4.csv

In [17]:
# Loading dataset
df4 = pd.read_csv('dataset_new/salaries_4.csv')

In [18]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13972 entries, 0 to 13971
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           13972 non-null  int64
 1   experience_level    13972 non-null  object
 2   employment_type     13972 non-null  object
 3   job_title           13972 non-null  object
 4   salary              13972 non-null  int64
 5   salary_currency     13972 non-null  object
 6   salary_in_usd       13972 non-null  int64
 7   employee_residence  13972 non-null  object
 8   remote_ratio        13972 non-null  int64
 9   company_location    13972 non-null  object
 10  company_size        13972 non-null  object
dtypes: int64(4), object(7)
memory usage: 1.2+ MB

In [19]:
df4.shape

(13972, 11)

In [20]:
#check null data
df4.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [21]:
# check duplicated rows and columns
# Check for duplicated column
df4.T.duplicated().sum()

0

Dataset 4 has 13,972 rows. we will keep explore other datasets, if they are similar to all the columns orders, we will drop the duplicated rows then.

#### 1.5. data salaries_5.csv

In [22]:
# Loading dataset
df5 = pd.read_csv('dataset_new/salaries_5.csv')

In [23]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10670 entries, 0 to 10669
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           10670 non-null  int64
 1   experience_level    10670 non-null  object
 2   employment_type     10670 non-null  object
 3   job_title           10670 non-null  object
 4   salary              10670 non-null  int64
 5   salary_currency     10670 non-null  object
 6   salary_in_usd       10670 non-null  int64
 7   employee_residence  10670 non-null  object
 8   remote_ratio        10670 non-null  int64
 9   company_location    10670 non-null  object
 10  company_size        10670 non-null  object
dtypes: int64(4), object(7)
memory usage: 917.1+ KB

In [24]:
df5.shape

(10670, 11)

In [25]:
#check null data
df5.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [26]:
# check duplicated rows and columns
# Check for duplicated column
df5.T.duplicated().sum()

0

This data has 10670 rows and similar type of columns

#### 1.6. data salaries_6.csv

In [27]:
# Loading dataset
df6 = pd.read_csv('dataset_new/salaries_6.csv')

In [28]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8805 entries, 0 to 8804
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           8805 non-null   int64
 1   experience_level    8805 non-null   object
 2   employment_type     8805 non-null   object
 3   job_title           8805 non-null   object
 4   salary              8805 non-null   int64
 5   salary_currency     8805 non-null   object
 6   salary_in_usd       8805 non-null   int64
 7   employee_residence  8805 non-null   object
 8   remote_ratio        8805 non-null   int64
 9   company_location    8805 non-null   object
 10  company_size        8805 non-null   object
dtypes: int64(4), object(7)
memory usage: 756.8+ KB

In [29]:
df6.shape

(8805, 11)

In [30]:
#check null data
df6.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [31]:
# check duplicated rows and columns
# Check for duplicated column
df6.T.duplicated().sum()

0

Dataset of 6 has 8805 rows. Same type of 11 columns.

#### 1.7. data salaries_7.csv

In [32]:
# Loading dataset
df7 = pd.read_csv('dataset_new/salaries_7.csv')

In [33]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7974 entries, 0 to 7973
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           7974 non-null   int64
 1   experience_level    7974 non-null   object
 2   employment_type     7974 non-null   object
 3   job_title           7974 non-null   object
 4   salary              7974 non-null   int64
 5   salary_currency     7974 non-null   object
 6   salary_in_usd       7974 non-null   int64
 7   employee_residence  7974 non-null   object
 8   remote_ratio        7974 non-null   int64
 9   company_location    7974 non-null   object
 10  company_size        7974 non-null   object
dtypes: int64(4), object(7)
memory usage: 685.4+ KB

In [34]:
df7.shape

(7974, 11)

In [35]:
#check null data
df7.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [36]:
# check duplicated rows and columns
# Check for duplicated column
df7.T.duplicated().sum()

0

Dataset 7 has 7974 rows and 11 cleaned columns.

#### 1.8. data salaries_8.csv

In [37]:
# Loading dataset
df8 = pd.read_csv('dataset_new/salaries_8.csv')

In [38]:
df8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [39]:
df8.shape

(3755, 11)

In [40]:
#check null data
df8.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [41]:
# check duplicated rows and columns
# Check for duplicated column
df8.T.duplicated().sum()

0

There is 3755 rows and 11 columns in this set

#### 1.9. data salaries_9.csv

In [42]:
# Loading dataset
df9 = pd.read_csv('dataset_new/salaries_9.csv')

In [43]:
df9.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [44]:
df9.shape

(3755, 11)

In [45]:
#check null data
df9.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [46]:
# Check for duplicated column
df9.T.duplicated().sum()

0

That is the final dataset with 3755 rows and similar columns. Next step we will clean all the datasets.

It seems a clean dataset 1. We will explore other datasets as below.

### Par 2: Cleaning data

#### 2.1: Merging useful datasets

In [47]:
# List of DataFrames
dfs = [df1, df2, df3, df4, df5, df6, df7, df8, df9]

# Concatenate the DataFrames into a single DataFrame
merged_df = pd.concat(dfs, ignore_index=True)

# Optionally, you can reset the index if needed
# merged_df.reset_index(drop=True, inplace=True)

# Save the merged DataFrame to a new CSV file
merged_df.to_csv('merged_salaries.csv', index=False)

In [48]:
merged_df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,EN,FL,Applied Data Scientist,30000,USD,30000,GB,100,GB,M
1,2024,EX,FT,Business Intelligence,230000,USD,230000,US,0,US,M
2,2024,EX,FT,Business Intelligence,176900,USD,176900,US,0,US,M
3,2024,SE,FT,Data Architect,171210,USD,171210,CA,0,CA,M
4,2024,SE,FT,Data Architect,92190,USD,92190,CA,0,CA,M

In [49]:
merged_df.shape

(93221, 11)

In [50]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93221 entries, 0 to 93220
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           93221 non-null  int64
 1   experience_level    93221 non-null  object
 2   employment_type     93221 non-null  object
 3   job_title           93221 non-null  object
 4   salary              93221 non-null  int64
 5   salary_currency     93221 non-null  object
 6   salary_in_usd       93221 non-null  int64
 7   employee_residence  93221 non-null  object
 8   remote_ratio        93221 non-null  int64
 9   company_location    93221 non-null  object
 10  company_size        93221 non-null  object
dtypes: int64(4), object(7)
memory usage: 7.8+ MB

#### 2.2: Build a cleaning dataframe

In [51]:
# Check for duplicated column
merged_df.T.duplicated().sum()

0

In [52]:
#check the duplcated rows
merged_df.duplicated().sum()

83745

In [53]:
#check for null data
#check null data
df3.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [54]:
# Drop the duplicated rows 
merged_df = merged_df.drop_duplicates()

In [55]:
#check the duplcated rows again
merged_df.duplicated().sum()

0

In [56]:
merged_df.shape

(9476, 11)

In [57]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9476 entries, 0 to 89446
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           9476 non-null   int64
 1   experience_level    9476 non-null   object
 2   employment_type     9476 non-null   object
 3   job_title           9476 non-null   object
 4   salary              9476 non-null   int64
 5   salary_currency     9476 non-null   object
 6   salary_in_usd       9476 non-null   int64
 7   employee_residence  9476 non-null   object
 8   remote_ratio        9476 non-null   int64
 9   company_location    9476 non-null   object
 10  company_size        9476 non-null   object
dtypes: int64(4), object(7)
memory usage: 888.4+ KB

There are a large drop from duplicated rows from totally 9 datasets. However, there are random datasets with similar columns so there are high chance of duplicated data. The cleaned data contain 9,476 rows and 11 columns without null or duplicated data. It will be ready for EDA and modeling process.

Then we will create a new merged_df.csv file in the same folder for the next step.

In [61]:
# Define the directory path
directory = 'dataset_new/'

# Initialize an empty DataFrame to store the merged data
merged_df = pd.DataFrame()

# Loop through each file in the directory
for filename in os.listdir(directory):
    if filename.endswith(".csv"):
        # Read the CSV file
        filepath = os.path.join(directory, filename)
        df = pd.read_csv(filepath)
        # Merge with the existing DataFrame
        merged_df = pd.concat([merged_df, df], ignore_index=True)

# Drop duplicates
merged_df = merged_df.drop_duplicates()

# Save the cleaned, merged DataFrame as a new CSV file
merged_df.to_csv(os.path.join(directory, 'cleaned_merged_df.csv'), index=False)

#### 2.3: Choose target columns

We will predict the salary trend so there are 3 columns relating to money which are salary, salary_in_usd and salary_currency. For the uniform data, we will choose salary_in_usd and drop other columns.

In [59]:
# Drop the 'salary' and 'salary_currency' columns from the merged DataFrame
merged_df.drop(['salary', 'salary_currency'], axis=1, inplace=True)

In [60]:
merged_df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,EN,FL,Applied Data Scientist,30000,GB,100,GB,M
1,2024,EX,FT,Business Intelligence,230000,US,0,US,M
2,2024,EX,FT,Business Intelligence,176900,US,0,US,M
3,2024,SE,FT,Data Architect,171210,CA,0,CA,M
4,2024,SE,FT,Data Architect,92190,CA,0,CA,M

The merged_df is ready for the reprocessing and modeling process in the next jupiter notebook.

--- to be continued--